<?php

use app\common\helper\ArrayHelper;
use think\facade\Db;
use think\migration\Migrator;
use think\migration\db\Column;

class AddProducts extends Migrator
{
    /**
     * Change Method.
     *
     * Write your reversible migrations using this method.
     *
     * More information on writing migrations is available here:
     * http://docs.phinx.org/en/latest/migrations.html#the-abstractmigration-class
     *
     * The following commands can be used in this method and Phinx will
     * automatically reverse them when rolling back:
     *
     *    createTable
     *    renameTable
     *    addColumn
     *    renameColumn
     *    addIndex
     *    addForeignKey
     *
     * Remember to call "create()" or "update()" and NOT "save()" when working
     * with the Table class.
     */
    public function change()
    {

//        $select = Db::name('product')->select()->toArray();
//        foreach ($select as $item){
//            Db::name('product_data')->insert([
//                'id' => $item['id'],
//                'pid' => $item['id'],
//                'create_time' => time()
//            ]);
//        }
//        return true;
        $data = [
//            ['H指连续','HIHHIF'],
            ['小恒连续','HIMHIF'],
            ['恒指连续','HIHSIF'],
            ['黄金期货','CMGCA0'],
            ['白银期货','CMSIA0'],
            ['WTI原油期货','NECLA0'],
            ['纳斯达克100','IXIXNDX'],
            ['德国ETF','IXIXGDAXI'],
            ['标普500','CEESA0'],
            ['比特币','BSbtcusd'],
            ['以太坊','BSethusd'],
            ['莱特币','BSltcusd'],
            ['EOS','HBeosusdt'],
            ['TRX','HBtrxusdt']



//            ['小H连续','HIMCHF'],
//            ['美黄金主力','CMGCA0'],
//            ['美黄金指数','CMGCI0'],
//            ['美精铜主力','CMHGA0'],
//            ['美精铜指数','CMHGI0'],
//            ['美白银主力','CMSIA0'],
//            ['美白银指数','CMSII0'],
//            ['钯金主力','NEPAA0'],
//            ['铂金主力','NEPLA0'],
//            ['白银现货','PMAG'],
//            ['铂金现货','PMAP'],
//            ['黄金现货','PMAU'],
//            ['钯金现货','PMPD'],
//            ['布伦特原油连续','IPBRNA0'],
//            ['布伦特柴油连续','IPGASA0'],
//            ['美原油连续','NECLA0'],
//            ['美原油指数','NECLI0'],
//            ['美燃料油连续','NEHOA0'],
//            ['美燃料油指数','NEHOI0'],
//            ['美天然气连续','NENGA0'],
//            ['钯金主力','NEPAA0'],
//            ['美轻质原油连续','NEQMA0'],
//            ['铂金主力','NEPLA0'],
//            ['美无铅汽油连续','NERBA0'],
//            ['DAX主连','CEDAXA0'],
//            ['小标普连续','CEESA0'],
//            ['小纳指连续','CENQA0'],
//            ['日经225连续','CENKA0'],
//            ['标普连续','CESPA0'],
//            ['小道琼连续','CEYMA0'],
//            ['比特币','BSbtcusd']



//            ['上证指数','SH000001'],
//            ['Ａ股指数','SH000002'],
//            ['Ｂ股指数','SH000003'],
//            ['工业指数','SH000004'],
//            ['商业指数','SH000005'],
//            ['地产指数','SH000006'],
//            ['公用指数','SH000007'],
//            ['综合指数','SH000008'],
//            ['上证380','SH000009'],
//            ['上证180','SH000010'],
//            ['基金指数','SH000011'],
//            ['国债指数','SH000012'],
//            ['红利指数','SH000015'],
//            ['上证50','SH000016'],
//            ['新综指','SH000017'],
//            ['180金融','SH000018'],
//            ['治理指数','SH000019'],
//            ['中型综指','SH000020'],
//            ['180治理','SH000021'],
//            ['沪公司债','SH000022'],
//            ['180基建','SH000025'],
//            ['180资源','SH000026'],
//            ['180运输','SH000027'],
//            ['180成长','SH000028'],
//            ['180价值','SH000029'],
//            ['180R成长','SH000030'],
//            ['180R价值','SH000031'],
//            ['上证能源','SH000032'],
//            ['上证材料','SH000033'],
//            ['上证工业','SH000034'],
//            ['上证可选','SH000035'],
//            ['上证消费','SH000036'],
//            ['上证医药','SH000037'],
//            ['上证金融','SH000038'],
//            ['上证信息','SH000039'],
//            ['上证电信','SH000040'],
//            ['上证公用','SH000041'],
//            ['上证央企','SH000042'],
//            ['超大盘','SH000043'],
//            ['上证中盘','SH000044'],
//            ['上证小盘','SH000045'],
//            ['上证中小','SH000046'],
//            ['上证全指','SH000047'],
//            ['责任指数','SH000048'],
//            ['上证民企','SH000049'],
//            ['50等权','SH000050'],
//            ['180等权','SH000051'],
//            ['50基本','SH000052'],
//            ['180基本','SH000053'],
//            ['上证海外','SH000054'],
//            ['上证地企','SH000055'],
//            ['上证国企','SH000056'],
//            ['全指成长','SH000057'],
//            ['全指价值','SH000058'],
//            ['全R成长','SH000059'],
//            ['全R价值','SH000060'],
//            ['沪企债30','SH000061'],
//            ['上证沪企','SH000062'],
//            ['上证周期','SH000063'],
//            ['非周期','SH000064'],
//            ['上证龙头','SH000065'],
//            ['上证商品','SH000066'],
//            ['上证新兴','SH000067'],
//            ['上证资源','SH000068'],
//            ['消费80','SH000069'],
//            ['能源等权','SH000070'],
//            ['材料等权','SH000071'],
//            ['工业等权','SH000072'],
//            ['可选等权','SH000073'],
//            ['消费等权','SH000074'],
//            ['医药等权','SH000075'],
//            ['金融等权','SH000076'],
//            ['信息等权','SH000077'],
//            ['电信等权','SH000078'],
//            ['公用等权','SH000079'],
//            ['上证流通','SH000090'],
//            ['沪财中小','SH000091'],
//            ['资源50','SH000092'],
//            ['180分层','SH000093'],
//            ['上证上游','SH000094'],
//            ['上证中游','SH000095'],
//            ['上证下游','SH000096'],
//            ['高端装备','SH000097'],
//            ['上证F200','SH000098'],
//            ['上证F300','SH000099'],
//            ['上证F500','SH000100'],
//            ['5年信用','SH000101'],
//            ['沪投资品','SH000102'],
//            ['沪消费品','SH000103'],
//            ['380能源','SH000104'],
//            ['380材料','SH000105'],
//            ['380工业','SH000106'],
//            ['380可选','SH000107'],
//            ['380消费','SH000108'],
//            ['380医药','SH000109'],
//            ['380金融','SH000110'],
//            ['380信息','SH000111'],
//            ['380电信','SH000112'],
//            ['380公用','SH000113'],
//            ['持续产业','SH000114'],
//            ['380等权','SH000115'],
//            ['信用100','SH000116'],
//            ['380成长','SH000117'],
//            ['380价值','SH000118'],
//            ['380R成长','SH000119'],
//            ['380R价值','SH000120'],
//            ['医药主题','SH000121'],
//            ['农业主题','SH000122'],
//            ['180动态','SH000123'],
//            ['180稳定','SH000125'],
        ];
//        foreach ($data as $item){
//            $res = [];
//            if(Db::name('product')->where('xcode',$item[1])->count() == 0){
//                Db::startTrans();
//                $res[] = Db::name('product')->insertGetId([
//                    'ptitle' => $item[0],
//                    'xcode' => $item[1],
//                    'procode' => $item[1],
//                    'type'=>1,
//                    'cate_id'=>0,
//                    'auto'=>0,
//                    'hot'=>1,
//                    'opentime' =>'["08:00~24:00","08:00~24:00","08:00~24:00","08:00~24:00","08:00~24:00","08:00~24:00","08:00~24:00"]',
//                    'create_time' => time()
//                ]);
//                $res[] = Db::name('product_data')->insert([
//                    'pid' => $res[0],
//                    'id' => $res[0],
//                    'create_time' => time()
//                    ]);
//                if (!empty($res) && ArrayHelper::checkArr($res)) {
//                    Db::commit();
//                }else{
//                    Db::rollback();
//                }
//            }
//        }
    }
}
